app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('Laptop', '2025-10-27 09:27:36.746894', '2025-10-27 09:27:36.746894') RETURNING "id"